Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetAllObjectsWithType Method (ModelObject.ModelObjectEnum)
 Returns an enumerator of all the model objects in the current model with the given type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetAllObjectsWithType(
	ModelObject.ModelObjectEnum Enum
)
Public Function GetAllObjectsWithType (
	Enum As ModelObject.ModelObjectEnum
) As ModelObjectEnumerator
Parameters
Enum
Type: Tekla.Structures.Model.ModelObject.ModelObjectEnum
The type of the objects to return.
Return Value
Type: ModelObjectEnumerator
A model object enumerator of all the model objects with the given type.
See Also
Reference
ModelObjectSelector Class
GetAllObjectsWithType Overload
Tekla.Structures.Model Namespace